const image_category = [
    "인물", "동물", "자연, 식물", "지형", "하늘", "우주(천체)", "소품", "색체", "아이콘", "건축물", "인테리어", "가전제품", "음식",
    "카드, 쿠폰", "미술", "교통", "도서, 음반, DVD", "문구류", "악세서리", "기타"
];

const major_big = [
    "인문계열",  "교육계열", "사회계열", "자연계열", "공학계열", "의약계열", "예ㆍ체능계열"
];
const major_small = {
    major_1 : ["교양어ㆍ문학", "교양인문학", "국어ㆍ국문학", "국제지역학", "기타아시아어ㆍ문학", "기타유럽어ㆍ문학", "독일어ㆍ문학", "러시아어ㆍ문학", "문헌정보학", "문화ㆍ민속ㆍ미술사학", "스페인어ㆍ문학", "심리학", "언어학", "역사ㆍ고고학", "영미어ㆍ문학", "일본어ㆍ문학", "종교학", "중국어ㆍ문학", "철학ㆍ윤리학", "프랑스어ㆍ문학"],
    major_2 : ["공학교육", "교육학", "사회교육", "언어교육", "예체능교육", "유아교육학", "인문교육", "자연계교육", "초등교육학", "특수교육"],
    major_3 : ["가족ㆍ사회ㆍ복지학", "경영학", "경제학", "관광학", "광고·홍보학", "교양경상학", "교양사회과학", "국제학", "금융ㆍ회계ㆍ세무학", "도시ㆍ지역학", "무역ㆍ유통학", "법학", "사회학", "언론ㆍ방송ㆍ매체학", "정치외교학", "행정학"],
    major_4 : ["가정관리학", "교양생활과학", "교양자연과학", "농업학", "동물ㆍ수의학", "물리ㆍ과학", "산림ㆍ원예학", "생명과학", "생물학", "수산학", "수학", "식품영양학", "의류ㆍ의상학", "자원학", "지구ㆍ지리학", "천문ㆍ기상학", "통계학", "화학", "환경학"],
    major_5 : ["건축학", "건축ㆍ설비공학", "광학공학", "교양공학", "금속공학", "기계공학", "기전공학", "도시공학", "반도체ㆍ세라믹공학", "산업공학", "섬유공학", "신소재공학", "에너지공학", "응용공학", "응용소프트웨어공학", "자동차공학", "재료공학", "전기공학", "전산학ㆍ컴퓨터공학", "전자공학", "정보ㆍ통신공학", "제어계측공학", "조경학", "지상교통공학", "토목공학", "항공학", "해양공학", "화학공학"],
    major_6 : ["간호학", "보건학", "약학", "의료공학", "의학", "재활학", "치의학", "한의학"],
    major_7 : ["공예", "국악", "기악", "기타디자인", "기타음악", "디자인일반", "무용", "사진ㆍ만화", "산업디자인", "성악", "순수미술", "시각디자인", "연극ㆍ영화", "영상ㆍ예술", "음악학", "응용미술", "작곡", "조형", "체육", "패션디자인"]
};



module.exports.image_category = image_category;
module.exports.major_big = major_big;
module.exports.major_small = major_small;